# taps
tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "clementtsang/bottom"
tap "ethereum/ethereum"
tap "fumiyas/echo-sd"
tap "heroku/brew"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "mas-cli/tap"
tap "minamijoyo/tfupdate"
tap "mongodb/brew"
tap "sanemat/font"
tap "sqldef/sqldef"
tap "stripe/stripe-cli"

# brew
brew "actionlint"
brew "brotli"
brew "giflib"
brew "imath"
brew "libpng"
brew "libtiff"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "apr"
brew "ca-certificates"
brew "apr-util"
brew "argon2"
brew "berkeley-db"
brew "gdbm"
brew "ncurses"
brew "perl"
brew "asciiquarium"
brew "aspell"
brew "assimp"
brew "gettext"
brew "pcre2"
brew "glib"
brew "libffi"
brew "mpdecimal"
brew "pcre"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "atk"
brew "m4"
brew "autoconf"
brew "automake"
brew "bat"
brew "bdw-gc"
brew "libusb"
brew "bettercap"
brew "binutils"
brew "bison"
brew "icu4c"
brew "lz4"
brew "zstd"
brew "boost"
brew "pkg-config"
brew "libpthread-stubs"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "broot"
brew "c-ares"
brew "freetype"
brew "fontconfig"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "cjson"
brew "clang-format"
brew "cloc"
brew "graphite2"
brew "harfbuzz"
brew "little-cms2"
brew "openjdk"
brew "rlwrap"
brew "clojure"
brew "cmake"
brew "cmatrix"
brew "cmigemo"
brew "cmocka"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "libssh2"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "libavif"
brew "gd"
brew "gmp"
brew "krb5"
brew "libpq"
brew "libsodium"
brew "libzip"
brew "oniguruma"
brew "tidy-html5"
brew "php"
brew "composer"
brew "coreutils"
brew "dav1d"
brew "dbus"
brew "deno"
brew "direnv"
brew "dog"
brew "double-conversion"
brew "dust"
brew "editorconfig"
brew "ethereum"
brew "exa"
brew "exiftool"
brew "extract_url"
brew "libyaml"
brew "ruby"
brew "terminal-notifier"
brew "fastlane"
brew "fd"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "guile"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "lame"
brew "jpeg", link: true
brew "openjpeg"
brew "leptonica"
brew "libb2"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "mbedtls"
brew "librist"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsamplerate"
brew "libsoxr"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "srt"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "hwloc"
brew "open-mpi"
brew "fftw"
brew "findutils"
brew "fish"
brew "libspiro"
brew "libuninameslist"
brew "pango"
brew "python@3.10"
brew "fontforge"
brew "fzf"
brew "fzy"
brew "gauche"
brew "gdk-pixbuf"
brew "genact"
brew "gh"
brew "jbig2dec"
brew "libidn"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "jansson"
brew "universal-ctags"
brew "global"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gping"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "hicolor-icon-theme"
brew "gtk+"
brew "htop"
brew "hugo"
brew "hunspell"
brew "imagemagick@6"
brew "imlib2"
brew "isync"
brew "jags"
brew "jid"
brew "jq"
brew "libcaca"
brew "libcbor"
brew "libepoxy"
brew "libfido2"
brew "libfixposix"
brew "libgccjit"
brew "libiconv"
brew "libmng"
brew "libressl"
brew "libscrypt"
brew "libslirp"
brew "libssh"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libxml2"
brew "six"
brew "z3"
brew "llvm"
brew "lua"
brew "luajit"
brew "luajit-openresty"
brew "luv"
brew "md4c"
brew "memcached"
brew "meson"
brew "mg"
brew "mhash"
brew "micro"
brew "mkcert"
brew "protobuf"
brew "mosh"
brew "s-lang"
brew "most"
brew "mplayer"
brew "msgpack"
brew "mu"
brew "mysql"
brew "nano"
brew "nasm"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nginx"
brew "nkf"
brew "node"
brew "nodebrew"
brew "nspr"
brew "nss"
brew "offlineimap"
brew "openssl@3"
brew "pandoc"
brew "peco"
brew "pinentry-mac"
brew "vde"
brew "qemu"
brew "podman"
brew "poppler"
brew "portaudio"
brew "procs"
brew "pv"
brew "pwgen"
brew "py3cairo"
brew "pygobject3"
brew "tcl-tk"
brew "qt"
brew "rbenv"
brew "re2c"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "roswell"
brew "rustup-init"
brew "sl"
brew "slides"
brew "solidity"
brew "source-highlight"
brew "speedtest-cli"
brew "stunnel"
brew "telnet"
brew "texinfo"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "utf8proc"
brew "tmux"
brew "tokei"
brew "tor"
brew "tree"
brew "typespeed"
brew "unar"
brew "urlview"
brew "vlang"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "z"
brew "zig"
brew "aws/tap/aws-sam-cli"
brew "heroku/brew/heroku-node"
brew "heroku/brew/heroku"
brew "minamijoyo/tfupdate/tfupdate"
brew "mongodb/brew/mongodb-community"
brew "sanemat/font/ricty"
brew "sqldef/sqldef/mysqldef"
brew "stripe/stripe-cli/stripe"

# cask
cask "alacritty"
cask "alfred"
cask "aquaskk"
cask "chromedriver"
cask "clipy"
cask "flutter"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-kufi-arabic"
cask "font-noto-mono"
cask "font-noto-naskh-arabic"
cask "font-noto-nastaliq-urdu"
cask "font-noto-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-adlam"
cask "font-noto-sans-adlam-unjoined"
cask "font-noto-sans-anatolian-hieroglyphs"
cask "font-noto-sans-arabic"
cask "font-noto-sans-arabic-ui"
cask "font-noto-sans-armenian"
cask "font-noto-sans-avestan"
cask "font-noto-sans-balinese"
cask "font-noto-sans-bamum"
cask "font-noto-sans-bassa-vah"
cask "font-noto-sans-batak"
cask "font-noto-sans-bengali"
cask "font-noto-sans-bengali-ui"
cask "font-noto-sans-bhaiksuki"
cask "font-noto-sans-brahmi"
cask "font-noto-sans-buginese"
cask "font-noto-sans-buhid"
cask "font-noto-sans-canadian-aboriginal"
cask "font-noto-sans-carian"
cask "font-noto-sans-caucasian-albanian"
cask "font-noto-sans-chakma"
cask "font-noto-sans-cham"
cask "font-noto-sans-cherokee"
cask "font-noto-sans-cjk"
cask "font-noto-sans-cjk-jp"
cask "font-noto-sans-cjk-kr"
cask "font-noto-sans-cjk-sc"
cask "font-noto-sans-cjk-tc"
cask "font-noto-sans-coptic"
cask "font-noto-sans-cuneiform"
cask "font-noto-sans-cypriot"
cask "font-noto-sans-deseret"
cask "font-noto-sans-devanagari"
cask "font-noto-sans-display"
cask "font-noto-sans-duployan"
cask "font-noto-sans-egyptian-hieroglyphs"
cask "font-noto-sans-elbasan"
cask "font-noto-sans-elymaic"
cask "font-noto-sans-ethiopic"
cask "font-noto-sans-georgian"
cask "font-noto-sans-glagolitic"
cask "font-noto-sans-gothic"
cask "font-noto-sans-grantha"
cask "font-noto-sans-gujarati"
cask "font-noto-sans-gunjala-gondi"
cask "font-noto-sans-gurmukhi"
cask "font-noto-sans-gurmukhi-ui"
cask "font-noto-sans-hanifi-rohingya"
cask "font-noto-sans-hanunoo"
cask "font-noto-sans-hatran"
cask "font-noto-sans-hebrew"
cask "font-noto-sans-hk"
cask "font-noto-sans-imperial-aramaic"
cask "font-noto-sans-indic-siyaq-numbers"
cask "font-noto-sans-inscriptional-pahlavi"
cask "font-noto-sans-inscriptional-parthian"
cask "font-noto-sans-javanese"
cask "font-noto-sans-jp"
cask "font-noto-sans-kaithi"
cask "font-noto-sans-kannada"
cask "font-noto-sans-kannada-ui"
cask "font-noto-sans-kayah-li"
cask "font-noto-sans-kharoshthi"
cask "font-noto-sans-khmer"
cask "font-noto-sans-khmer-ui"
cask "font-noto-sans-khojki"
cask "font-noto-sans-khudawadi"
cask "font-noto-sans-kr"
cask "font-noto-sans-lao"
cask "font-noto-sans-lao-ui"
cask "font-noto-sans-lepcha"
cask "font-noto-sans-limbu"
cask "font-noto-sans-linear-a"
cask "font-noto-sans-linear-b"
cask "font-noto-sans-lisu"
cask "font-noto-sans-lycian"
cask "font-noto-sans-lydian"
cask "font-noto-sans-mahajani"
cask "font-noto-sans-malayalam"
cask "font-noto-sans-malayalam-ui"
cask "font-noto-sans-mandaic"
cask "font-noto-sans-manichaean"
cask "font-noto-sans-marchen"
cask "font-noto-sans-masaram-gondi"
cask "font-noto-sans-math"
cask "font-noto-sans-mayan-numerals"
cask "font-noto-sans-medefaidrin"
cask "font-noto-sans-meetei-mayek"
cask "font-noto-sans-mende-kikakui"
cask "font-noto-sans-meroitic"
cask "font-noto-sans-miao"
cask "font-noto-sans-modi"
cask "font-noto-sans-mongolian"
cask "font-noto-sans-mono"
cask "font-noto-sans-mro"
cask "font-noto-sans-multani"
cask "font-noto-sans-myanmar"
cask "font-noto-sans-n-ko"
cask "font-noto-sans-nabataean"
cask "font-noto-sans-new-tai-lue"
cask "font-noto-sans-newa"
cask "font-noto-sans-nushu"
cask "font-noto-sans-ogham"
cask "font-noto-sans-ol-chiki"
cask "font-noto-sans-old-hungarian"
cask "font-noto-sans-old-italic"
cask "font-noto-sans-old-north-arabian"
cask "font-noto-sans-old-permic"
cask "font-noto-sans-old-persian"
cask "font-noto-sans-old-sogdian"
cask "font-noto-sans-old-south-arabian"
cask "font-noto-sans-old-turkic"
cask "font-noto-sans-oriya"
cask "font-noto-sans-osage"
cask "font-noto-sans-osmanya"
cask "font-noto-sans-pahawh-hmong"
cask "font-noto-sans-palmyrene"
cask "font-noto-sans-pau-cin-hau"
cask "font-noto-sans-phags-pa"
cask "font-noto-sans-phoenician"
cask "font-noto-sans-psalter-pahlavi"
cask "font-noto-sans-rejang"
cask "font-noto-sans-runic"
cask "font-noto-sans-samaritan"
cask "font-noto-sans-saurashtra"
cask "font-noto-sans-sc"
cask "font-noto-sans-sharada"
cask "font-noto-sans-shavian"
cask "font-noto-sans-siddham"
cask "font-noto-sans-sinhala"
cask "font-noto-sans-sinhala-ui"
cask "font-noto-sans-sogdian"
cask "font-noto-sans-sora-sompeng"
cask "font-noto-sans-soyombo"
cask "font-noto-sans-sundanese"
cask "font-noto-sans-syloti-nagri"
cask "font-noto-sans-symbols"
cask "font-noto-sans-symbols-2"
cask "font-noto-sans-syriac-eastern"
cask "font-noto-sans-syriac-estrangela"
cask "font-noto-sans-syriac-western"
cask "font-noto-sans-tagalog"
cask "font-noto-sans-tagbanwa"
cask "font-noto-sans-tai-le"
cask "font-noto-sans-tai-tham"
cask "font-noto-sans-tai-viet"
cask "font-noto-sans-takri"
cask "font-noto-sans-tamil"
cask "font-noto-sans-tamil-supplement"
cask "font-noto-sans-tamil-ui"
cask "font-noto-sans-tc"
cask "font-noto-sans-telugu"
cask "font-noto-sans-telugu-ui"
cask "font-noto-sans-thaana"
cask "font-noto-sans-thai"
cask "font-noto-sans-thai-ui"
cask "font-noto-sans-tibetan"
cask "font-noto-sans-tifinagh"
cask "font-noto-sans-tirhuta"
cask "font-noto-sans-ugaritic"
cask "font-noto-sans-vai"
cask "font-noto-sans-wancho"
cask "font-noto-sans-warang-citi"
cask "font-noto-sans-yi"
cask "font-noto-sans-zanabazar-square"
cask "font-noto-serif"
cask "font-noto-serif-armenian"
cask "font-noto-serif-bengali"
cask "font-noto-serif-cjk"
cask "font-noto-serif-cjk-jp"
cask "font-noto-serif-cjk-kr"
cask "font-noto-serif-cjk-sc"
cask "font-noto-serif-cjk-tc"
cask "font-noto-serif-devanagari"
cask "font-noto-serif-display"
cask "font-noto-serif-ethiopic"
cask "font-noto-serif-georgian"
cask "font-noto-serif-gujarati"
cask "font-noto-serif-hebrew"
cask "font-noto-serif-kannada"
cask "font-noto-serif-khmer"
cask "font-noto-serif-lao"
cask "font-noto-serif-malayalam"
cask "font-noto-serif-myanmar"
cask "font-noto-serif-sinhala"
cask "font-noto-serif-tamil"
cask "font-noto-serif-telugu"
cask "font-noto-serif-thai"
cask "keycastr"
cask "ngrok"
cask "qmk-toolbox"
cask "react-native-debugger"
cask "sequel-ace"
cask "wireshark"
cask "xquartz"
