jethrokuan/z
franciscolourenco/done
decors/fish-ghq
jduchateau/fish-flutter-completions
lgathy/google-cloud-sdk-fish-completion
takeokunn/fish-dart-completions
takeokunn/fish-common-lisp-completions
adriaanzon/fish-artisan-completion
