0rax/fish-bd
adriaanzon/fish-artisan-completion
decors/fish-ghq
dracula/fish
edc/bass
franciscolourenco/done
jduchateau/fish-flutter-completions
jethrokuan/z
jorgebucaran/autopair.fish
lgathy/google-cloud-sdk-fish-completion
takeokunn/fish-dart-completions
takeokunn/fish-ecs-cli-completions
lilyball/nix-env.fish
